cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Utilities
brew 'wget'

# Browsers
cask 'firefox'
cask 'firefox-developer-edition'

# Messaging
cask 'telegram'
cask 'discord'

# Productivity
cask 'evernote'
cask 'libreoffice'

cask 'anki'

# Media
#  Ebooks
cask 'calibre'
cask 'yacreader'

#  Music
cask 'clementine'
cask 'spotify'

#  Video
cask 'vlc'

#  Torrents
cask 'qbittorrent'

# Development
cask 'visual-studio-code'
cask 'pycharm'
cask 'atom'

cask 'mongodb-compass-community'

cask 'java'

brew 'git'
cask 'sourcetree'

brew 'python'
brew 'node'

brew 'clojure/tools/clojure'
brew 'leiningen'

cask 'godot'

# Design
cask 'inkscape'

# Infrastructure
cask 'appcleaner'

cask 'expressvpn'

cask 'dropbox'
cask 'google-backup-and-sync'

cask 'keepassxc'

# Mac App Store
brew 'mas'
mas 'Todoist', id: 585829637

# Fonts
#   Sans
cask 'font-poppins'
cask 'font-roboto'
# cask 'font-tomorrow' https://fonts.google.com/specimen/Tomorrow
#   Serif
cask 'font-grenze'
cask 'font-crimson-text'
#   Monospace
cask 'font-fira-code'
