tap "homebrew/cask"
cask_args appdir: "/Applications"

brew 'mas'

# Browsers
cask 'firefox'

# Messaging
cask 'telegram'
cask 'discord'

# Productivity
cask 'evernote'

mas 'Todoist', id: 585829637

# Media
cask 'spotify'

cask 'calibre'

# Development
cask 'visual-studio-code'
cask 'atom'

cask 'java'

brew 'git'

brew 'python'
brew 'node'

brew 'clojure/tools/clojure'
brew 'leiningen'

# Design
cask 'inkscape'

